{"weightsManifest": [{"weights": [{"name": "conv1d_1/kernel", "dtype": "float32", "shape": [4, 1, 16]}, {"name": "conv1d_1/bias", "dtype": "float32", "shape": [16]}, {"name": "conv1d_10/kernel", "dtype": "float32", "shape": [4, 128, 128]}, {"name": "conv1d_10/bias", "dtype": "float32", "shape": [128]}, {"name": "conv1d_11/kernel", "dtype": "float32", "shape": [4, 128, 128]}, {"name": "conv1d_11/bias", "dtype": "float32", "shape": [128]}, {"name": "conv1d_2/kernel", "dtype": "float32", "shape": [4, 16, 32]}, {"name": "conv1d_2/bias", "dtype": "float32", "shape": [32]}, {"name": "conv1d_3/kernel", "dtype": "float32", "shape": [4, 32, 64]}, {"name": "conv1d_3/bias", "dtype": "float32", "shape": [64]}, {"name": "conv1d_4/kernel", "dtype": "float32", "shape": [4, 64, 128]}, {"name": "conv1d_4/bias", "dtype": "float32", "shape": [128]}, {"name": "conv1d_5/kernel", "dtype": "float32", "shape": [4, 128, 128]}, {"name": "conv1d_5/bias", "dtype": "float32", "shape": [128]}, {"name": "conv1d_6/kernel", "dtype": "float32", "shape": [4, 128, 128]}, {"name": "conv1d_6/bias", "dtype": "float32", "shape": [128]}, {"name": "conv1d_7/kernel", "dtype": "float32", "shape": [4, 128, 128]}, {"name": "conv1d_7/bias", "dtype": "float32", "shape": [128]}, {"name": "conv1d_8/kernel", "dtype": "float32", "shape": [4, 128, 128]}, {"name": "conv1d_8/bias", "dtype": "float32", "shape": [128]}, {"name": "conv1d_9/kernel", "dtype": "float32", "shape": [4, 128, 128]}, {"name": "conv1d_9/bias", "dtype": "float32", "shape": [128]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [128, 50]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [50]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [50, 1]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [1]}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"keras_version": "2.1.5", "model_config": {"config": [{"config": {"name": "conv1d_1", "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "trainable": true, "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_size": [4], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 16, "bias_constraint": null, "batch_input_shape": [null, 17640, 1], "use_bias": true, "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "conv1d_2", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_1", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"name": "conv1d_3", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_2", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "conv1d_4", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_3", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"name": "conv1d_5", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_4", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"name": "conv1d_6", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_5", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"name": "conv1d_7", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_6", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "conv1d_8", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_7", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"name": "conv1d_9", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_8", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"name": "conv1d_10", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.019999999552965164, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_9", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"name": "conv1d_11", "trainable": true, "bias_regularizer": null, "padding": "same", "dilation_rate": [1], "activation": "elu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.029999999329447746, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "bias_constraint": null, "kernel_size": [4], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_10", "trainable": true, "pool_size": [2], "strides": [4], "padding": "same"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "units": 50, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "units": 1, "bias_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"optimizer_config": {"config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "decay": 0.0, "lr": 0.0010000000474974513, "amsgrad": false}, "class_name": "Adam"}, "sample_weight_mode": null, "metrics": ["accuracy"], "loss_weights": null, "loss": "binary_crossentropy"}, "backend": "tensorflow"}, "generatedBy": "keras v2.1.5", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "format": "layers-model"}