{"format": "layers-model", "generatedBy": "keras v2.1.6", "weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv1d_1/kernel", "shape": [4, 1, 16]}, {"dtype": "float32", "name": "conv1d_1/bias", "shape": [16]}, {"dtype": "float32", "name": "conv1d_10/kernel", "shape": [4, 128, 128]}, {"dtype": "float32", "name": "conv1d_10/bias", "shape": [128]}, {"dtype": "float32", "name": "conv1d_11/kernel", "shape": [4, 128, 128]}, {"dtype": "float32", "name": "conv1d_11/bias", "shape": [128]}, {"dtype": "float32", "name": "conv1d_2/kernel", "shape": [4, 16, 32]}, {"dtype": "float32", "name": "conv1d_2/bias", "shape": [32]}, {"dtype": "float32", "name": "conv1d_3/kernel", "shape": [4, 32, 64]}, {"dtype": "float32", "name": "conv1d_3/bias", "shape": [64]}, {"dtype": "float32", "name": "conv1d_4/kernel", "shape": [4, 64, 128]}, {"dtype": "float32", "name": "conv1d_4/bias", "shape": [128]}, {"dtype": "float32", "name": "conv1d_5/kernel", "shape": [4, 128, 128]}, {"dtype": "float32", "name": "conv1d_5/bias", "shape": [128]}, {"dtype": "float32", "name": "conv1d_6/kernel", "shape": [4, 128, 128]}, {"dtype": "float32", "name": "conv1d_6/bias", "shape": [128]}, {"dtype": "float32", "name": "conv1d_7/kernel", "shape": [4, 128, 128]}, {"dtype": "float32", "name": "conv1d_7/bias", "shape": [128]}, {"dtype": "float32", "name": "conv1d_8/kernel", "shape": [4, 128, 128]}, {"dtype": "float32", "name": "conv1d_8/bias", "shape": [128]}, {"dtype": "float32", "name": "conv1d_9/kernel", "shape": [4, 128, 128]}, {"dtype": "float32", "name": "conv1d_9/bias", "shape": [128]}, {"dtype": "float32", "name": "dense_1/kernel", "shape": [128, 50]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [50]}, {"dtype": "float32", "name": "dense_2/kernel", "shape": [50, 1]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [1]}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"config": {"decay": 0.0, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "amsgrad": false, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "sample_weight_mode": null}, "model_config": {"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "dtype": "float32", "activation": "elu", "bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 17640, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "name": "conv1d_1", "dilation_rate": [1], "strides": [1], "filters": 16, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_2", "dilation_rate": [1], "strides": [1], "filters": 32, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_1", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_3", "dilation_rate": [1], "strides": [1], "filters": 64, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_2", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"seed": null, "rate": 0.1, "noise_shape": null, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_4", "dilation_rate": [1], "strides": [1], "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_3", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_5", "dilation_rate": [1], "strides": [1], "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_4", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_6", "dilation_rate": [1], "strides": [1], "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_5", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_7", "dilation_rate": [1], "strides": [1], "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_6", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"seed": null, "rate": 0.1, "noise_shape": null, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_8", "dilation_rate": [1], "strides": [1], "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_7", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_9", "dilation_rate": [1], "strides": [1], "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_8", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.019999999552965164, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_10", "dilation_rate": [1], "strides": [1], "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_9", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [4], "activation": "elu", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.029999999329447746, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "name": "conv1d_11", "dilation_rate": [1], "strides": [1], "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"strides": [4], "padding": "same", "pool_size": [2], "name": "max_pooling1d_10", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"seed": null, "rate": 0.4, "noise_shape": null, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "units": 50, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "sigmoid", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow", "keras_version": "2.1.6"}, "convertedBy": "TensorFlow.js Converter v1.2.2.1"}